#pragma once

//-----------------------------------------------------------------
// File Include
//-----------------------------------------------------------------
#include "Util/SingletonDef.h"

#include <d3d12.h>


class PMDRenderer {
	SINGLETON_HEADER(PMDRenderer)
	//----------------------------------------------------
	// メソッド
	//----------------------------------------------------
public:
	// @brief クラスの初期化
	// @note このクラスを使用する前に一度必ず呼び出すこと
	bool Init(ID3D12Device* device);


	//----------------------------------------------------
	// メンバ変数
	//----------------------------------------------------
private:
	// TODO: シェーダーの生成をDx12ラッパーから移植する
};
